package projectmovie;

public class Prompt {
	
	public void Prompt_main() {
		String prompt = """
				=====================================================
						<< Jump to Moon >>
					
					1. 영화예매
					2. 예매확인
					3. 예매취소
					4. 회원가입하기
					5. 종료하기
					
				=====================================================
				번호를 입력해주세요: """;
		System.out.println(prompt);
	}
	
	public void Prompt_manager() {
		String prompt = """
				=====================================================
						<< 영화 예매 관리 프로그램 >>
					
					1. 영화등록
					2. 상영시간표 등록
					3. 영화 삭제하기
					4. 영화 목록 보기
					5. 회원 목록 보기
					6. 예매율 확인
					7. 첫 화면으로 돌아가기
					
				=====================================================
				번호를 입력해주세요: """;
		System.out.println(prompt);
	}
	
	
	public void Prompt_Reserv() {
		String prompt = """
				=====================================================
						<< 영화예매 >>
					
					1. 영화예매
					2. 예매확인
					3. 예매취소
					4. 회원가입하기
					5. 종료하기
					
				=====================================================
				""";
		System.out.println(prompt);
	}
	
}
